ПУМП/src/Catalogs/SK007/SK007.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SK007</name>
  <comment>Лицензии медицинской организации</comment>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>NUMBER</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LPU</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LPU_PODR</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DATE_BEG</name>
    <comment>Дата начала</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DATE_END</name>
    <comment>Дата окончания</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВведенВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>CODE_USL</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ПУМП/src/Catalogs/SK007/ObjectModule.bsl
//@skip-warning
//Предопределенная процедура
Процедура ПередЗаписью(Отказ)
	пНовый=ЭтотОбъект.ЭтоНовый();
	пКод=СОКРЛП(ЭтотОбъект.NUMBER)+"-"+СОКРЛП(ЭтотОбъект.LPU)+"-"+СОКРЛП(ЭтотОбъект.LPU_PODR)+"-"+
    	    		ОбщегоНазначенияПГБ2.DTOS(ЭтотОбъект.DATE_BEG);
	ЭтотОбъект.Код=пКод;
	Если пНовый Тогда
		ЭтотОбъект.ДатаСоздания=ТекущаяДата();
		ЭтотОбъект.ДатаИзменения=ЭтотОбъект.ДатаСоздания;
	Иначе
		ЭтотОбъект.ДатаИзменения=ТекущаяДата();
	КонецЕсли;		
КонецПроцедуры
